"""
======================================
1. Создай три класса: Cat, Dog, Duck.
В каждом реализуй метод speak(), возвращающий уникальную строку.
Создай список из экземпляров этих классов и вызови метод speak()
в цикле.
======================================"""

# class Dog:
#
#     def speak(self):
#         return "ГАВ ГАВ ГАВ"
#
# class Cat:
#
#     def speak(self):
#         return "МЯУ МЯУ МЯУ"
#
# class Duck:
#
#     def speak(self):
#         return "КРЯ КРЯ КРЯ"
#
# animals = [Dog(), Cat(), Duck()]
#
# for animal in animals:
#     print(animal.speak())

"""2. Создай базовый класс Shape
Создай три класса-наследника: Square, Rectangle, Triangle,
в каждом реализуй метод get_pr().
Проверь, что список shapes = [Square(...), Rectangle(...), Triangle(...)]
можно обойти в цикле и вызвать get_pr() у каждого.
======================================"""

# class Shape:
#     pass
#
# class Square(Shape):
#
#     def get_pr(self):
#         print("Метод get_pr у квадрата")
#
# class Rectangle(Shape):
#
#     def get_pr(self):
#         print("Метод get_pr у прямоугольника")
#
# class Triangle(Shape):
#
#     def get_pr(self):
#         print("Метод get_pr у треугольника")
#
# shapes = [Square(), Rectangle(), Triangle()]
# for shape in shapes:
#     shape.get_pr()

"""3. Сделай класс Shape абстрактным.
Переопредели get_pr() как @abstractmethod.
Попробуй создать объект класса Shape напрямую и убедись, что будет TypeError.
======================================"""

# from abc import ABC, abstractmethod
#
# class Shape(ABC):
#     @abstractmethod
#     def get_pr(self):
#         pass
#
# a = Shape() # Да, ошибка TypeError

"""4. Создай классы A, B, C, в каждом — свой __init__() с print("init A/B/C").
Наследуй D(A, B, C) и вызови super().__init__() в каждом __init__.
Выведи D.__mro__ и посмотри, в каком порядке вызываются инициализаторы.
======================================"""

# class A:
#     def __init__(self):
#         super().__init__()
#         print("init A")
#
# class B:
#     def __init__(self):
#         super().__init__()
#         print("init B")
#
# class C:
#     def __init__(self):
#         super().__init__()
#         print("init C")
#
# class D(A, B, C):
#     pass
#
# print(D.__mro__)
#
# d = D() # Иниты вызываюся в обратном порядке

"""5. Создай MixinLog (как в уроке).
Создай класс бронирования гостиницы (методы и атрибуты на свое усмотрение).
Создай класс, который наследует оба класса. Создай экземпляр этого класса.
======================================"""



"""6. В Goods и MixinLog реализуй print_info().
Создай NoteBook(Goods, MixinLog) и проверь, какой метод вызывается.
Измени порядок наследования — изменилась ли логика?
======================================
======================================
Далее задания можете сделать через классы, функции или без них.
======================================
======================================
7. Напиши программу, которая запрашивает (из консоли) два числа и делит первое на второе.
Если второе число равно нулю — обработай ошибку (как называется ошибка найди сам)
и выведи сообщение: "На ноль делить нельзя!"
======================================
8. Расширь программу из Задания 1:
Добавь обработку ошибки (как называется ошибка найди сам),
если пользователь ввёл не числа, а текст.
Выведи сообщение: "Ошибка ввода: введите два числа через пробел"
======================================
9. Модифицируй код так, чтобы после обработки конкретных ошибок
был ещё один общий except, который перехватывает все остальные ошибки и выводит:
"Произошла неизвестная ошибка"
======================================
10. При перехвате исключений из 7 и 8 заданий,
сохрани ошибку в переменную e и выведи её текст:
======================================
11. Создай код, который ловит арифметические ошибки (ArithmeticError) в одном блоке.
Попробуй специально сделать ошибку деления на ноль или другую арифметическую ошибку.
======================================
12. Запроси у пользователя два числа и выполни деление.
Если деление прошло успешно без ошибок — выведи
"Деление выполнено успешно" через (но не в блоке try)
======================================
13. Расширь код из Задания 12:
Добавь блок, в котором будет выводиться
"Работа программы завершена", независимо от успеха деления.
======================================
14. Реализуй две вложенные конструкции:
Внешний try/except обрабатывает неверный ввод (строки вместо чисел);
Внутренний try/except ловит деление на ноль.
======================================
15. Вынеси обработку деления в отдельную функцию divide(x, y)
с собственным try/except.
Во внешнем коде обработай только ошибку ввода.
"""